let_1 = input()
let_2 = input()
let_3 = input()
# За
combinations_cnt = 0

# ЗАБЕЛЕЖКА: For-циклите не могат да работят с букви!!
# Затова от ASCII таблицата, за всяко ЧИСЛО ще вземем отговарящата на него БУКВА!
# Например: интервала от f до k, НЕ МОЖЕ да бъде записан като range(f, k+1)
# Поради тази причина за буквите к и f ще вземем техните цифрени кодове, т.е. номерациите им в АСКИ таблицата

# Първият (на всеки отпечатани 3 символа) ще е ch1
# Той ще се изреди в интервала от въведена буква 'let_1' включително до буква 'let_2'
for ch1 in range(ord(let_1), ord(let_2) + 1):
    # Всеки отпечатан 2ри символ
    for ch2 in range(ord(let_1), ord(let_2) + 1):
        # Всеки отпечатан 3ти символ
        for ch3 in range(ord(let_1), ord(let_2) + 1):
            # Проверяваме АКО всеки един символ (преди да бъде отпечатан) НЕ СЪВПАДА с let_3, да се отпечата
            if ch1 != ord(let_3) and ch2 != ord(let_3) and ch3 != ord(let_3):
                ch = f'{chr(ch1)}{chr(ch2)}{chr(ch3)}'
                print(ch, end=' ')
                combinations_cnt += 1
            # В противен случай просто го игнорирай (прескочи) и продължи изпълнението на циклите
            # С команда 'continue' става тва
            else:
                continue
# След приключване на АБСОЛЮТНО всички цикли, принтирай броят отпечтвания, т.е. възможни комбинации букви
print(combinations_cnt)